#Упражнение №2: последняя цифра
#Дано натуральное число. Выведите его последнюю цифру.

print(int(input()) % 10)
