#Упражнение №1: калькулятор с пользовательским вводом
#Дано два числа a и b. Выведите сумму, разность и произведение чисел (каждое на новой строке).

a, b = int(input()), int(input())
print(f"{a+b}\n{a-b}\n{a*b}")